[
  "editing-toolbar",
  "markdown-table-editor",
  "obsidian-plantuml",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "obsidian-image-toolkit",
  "terminal",
  "floating-toc",
  "foldspace-obsidian-helper",
  "copilot"
]