

def solution(m: int, n: int):
    dp = [[0] * n for _ in range(m)]

    # 初始化边界条件
    for i in range(m): # 每个节点可以往右边
        """
        [
        [0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0],
        [0,0,0,0,0,0,0],
        ]
        ->
        [
        [1,0,0,0,0,0,0],
        [1,0,0,0,0,0,0],
        [1,0,0,0,0,0,0],
        ]
        """
        dp[i][0] = 1
    for j in range(n): # 每个节点可以往下走
        """
        [
        [1,1,1,1,1,1,1],
        [1,0,0,0,0,0,0],
        [1,0,0,0,0,0,0],
        ]
        """
        dp[0][j] = 1

    # 状态转移
    for i in range(1, m):  # 
        for j in range(1, n): #
            dp[i][j] = dp[i-1][j] + dp[i][j-1]

    return dp[m-1][n-1]
